RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_uart.c
#ifdef BSP_LPUART6_RX_USING_DMA
    static struct dma_rx_config uart6_dma_rx = {.request = kDmaRequestMuxLPUART6Rx, .channel = BSP_LPUART6_RX_DMA_CHANNEL, .last_index = 0};
    uarts[LPUART6_INDEX].dma_rx = &uart6_dma_rx;
    uarts[LPUART6_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_RX;
#endif
#ifdef BSP_LPUART6_TX_USING_DMA
    static struct dma_tx_config uart6_dma_tx = {.request = kDmaRequestMuxLPUART6Tx, .channel = BSP_LPUART6_TX_DMA_CHANNEL};
    uarts[LPUART6_INDEX].dma_tx = &uart6_dma_tx;
    uarts[LPUART6_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_TX;
#endif

#ifdef BSP_LPUART7_RX_USING_DMA
    static struct dma_rx_config uart7_dma_rx = {.request = kDmaRequestMuxLPUART7Rx, .channel = BSP_LPUART7_RX_DMA_CHANNEL, .last_index = 0};
    uarts[LPUART7_INDEX].dma_rx = &uart7_dma_rx;
    uarts[LPUART7_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_RX;
#endif
#ifdef BSP_LPUART7_TX_USING_DMA
    static struct dma_tx_config uart7_dma_tx = {.request = kDmaRequestMuxLPUART7Tx, .channel = BSP_LPUART7_TX_DMA_CHANNEL};
    uarts[LPUART7_INDEX].dma_tx = &uart7_dma_tx;
    uarts[LPUART7_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_TX;
#endif

#ifdef BSP_LPUART8_RX_USING_DMA
    static struct dma_rx_config uart8_dma_rx = {.request = kDmaRequestMuxLPUART8Rx, .channel = BSP_LPUART8_RX_DMA_CHANNEL, .last_index = 0};
    uarts[LPUART8_INDEX].dma_rx = &uart8_dma_rx;
    uarts[LPUART8_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_RX;
#endif
#ifdef BSP_LPUART8_TX_USING_DMA
    static struct dma_tx_config uart8_dma_tx = {.request = kDmaRequestMuxLPUART8Tx, .channel = BSP_LPUART8_TX_DMA_CHANNEL};
    uarts[LPUART8_INDEX].dma_tx = &uart8_dma_tx;
    uarts[LPUART8_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_TX;
#endif
#ifdef BSP_LPUART10_RX_USING_DMA
        static struct dma_rx_config uart10_dma_rx = {.request = kDmaRequestMuxLPUART10Rx, .channel = BSP_LPUART10_RX_DMA_CHANNEL, .last_index = 0};
        uarts[LPUART10_INDEX].dma_rx = &uart10_dma_rx;
        uarts[LPUART10_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_RX;
#endif
#ifdef BSP_LPUART10_TX_USING_DMA
        static struct dma_tx_config uart10_dma_tx = {.request = kDmaRequestMuxLPUART10Tx, .channel = BSP_LPUART10_TX_DMA_CHANNEL};
        uarts[LPUART10_INDEX].dma_tx = &uart10_dma_tx;
        uarts[LPUART10_INDEX].dma_flag |= RT_DEVICE_FLAG_DMA_TX;
#endif

}

static void uart_isr(struct imxrt_uart *uart);

#if defined(BSP_USING_LPUART1)

void LPUART1_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART1_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART1 */

#if defined(BSP_USING_LPUART2)
struct rt_serial_device serial2;

void LPUART2_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART2_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART2 */

#if defined(BSP_USING_LPUART3)
struct rt_serial_device serial3;

void LPUART3_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART3_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART3 */

#if defined(BSP_USING_LPUART4)

void LPUART4_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART4_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART4 */

#if defined(BSP_USING_LPUART5)
struct rt_serial_device serial5;

void LPUART5_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART5_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART5 */

#if defined(BSP_USING_LPUART6)
struct rt_serial_device serial6;

void LPUART6_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART6_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART6 */

#if defined(BSP_USING_LPUART7)
struct rt_serial_device serial7;

void LPUART7_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART7_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART7 */

#if defined(BSP_USING_LPUART8)
struct rt_serial_device serial8;

void LPUART8_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART8_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART8 */

#if defined(BSP_USING_LPUART10)
struct rt_serial_device serial10;

void LPUART10_IRQHandler(void)
{
    rt_interrupt_enter();

    uart_isr(&uarts[LPUART10_INDEX]);

    rt_interrupt_leave();
}

#endif /* BSP_USING_LPUART10 */




static void uart_isr(struct imxrt_uart *uart)
{
    RT_ASSERT(uart != RT_NULL);
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    rt_size_t total_index, recv_len;
    rt_base_t level;
#endif

    /* kLPUART_RxDataRegFullFlag can only cleared or set by hardware */
    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxDataRegFullFlag)
    {
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_IND);
    }

    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxOverrunFlag)
    {
        /* Clear overrun flag, otherwise the RX does not work. */
        rt_kprintf("%s overrun\r\n", uart->name);
        LPUART_ClearStatusFlags(uart->uart_base, kLPUART_RxOverrunFlag);
    }

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    if ((LPUART_GetStatusFlags(uart->uart_base) & kLPUART_IdleLineFlag) && (uart->dma_rx != RT_NULL))
    {
        LPUART_ClearStatusFlags(uart->uart_base, kLPUART_IdleLineFlag);
        level = rt_hw_interrupt_disable();

        total_index = uart->serial.config.bufsz - EDMA_GetRemainingMajorLoopCount(DMA0, uart->dma_rx->channel);
        if (total_index > uart->dma_rx->last_index)
        {
            recv_len = total_index - uart->dma_rx->last_index;
        }
        else
        {
            recv_len = total_index + (uart->serial.config.bufsz - uart->dma_rx->last_index);
        }

        if ((recv_len > 0) && (recv_len < uart->serial.config.bufsz))
        {
            uart->dma_rx->last_index = total_index;
            rt_hw_interrupt_enable(level);

            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
        }
        else
        {
            rt_hw_interrupt_enable(level);
        }
    }
#endif
}

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
void edma_rx_callback(struct _edma_handle *handle, void *userData, bool transferDone, uint32_t tcds)
{
    rt_size_t total_index, recv_len;
    rt_base_t level;
    struct imxrt_uart *uart = (struct imxrt_uart *)userData;
    RT_ASSERT(uart != RT_NULL);

    if (transferDone)
    {
        level = rt_hw_interrupt_disable();

