RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_uart.c
        if ((EDMA_GetChannelStatusFlags(DMA0, uart->dma_rx->channel) & kEDMA_DoneFlag) != 0U)
        {
            /* clear full interrupt */
            EDMA_ClearChannelStatusFlags(DMA0, uart->dma_rx->channel,kEDMA_DoneFlag);

            recv_len = uart->serial.config.bufsz - uart->dma_rx->last_index;
            uart->dma_rx->last_index = 0;
        }
        else
        {
            /* clear half interrupt */
            EDMA_ClearChannelStatusFlags(DMA0, uart->dma_rx->channel,kEDMA_InterruptFlag);

            total_index = uart->serial.config.bufsz - EDMA_GetRemainingMajorLoopCount(DMA0, uart->dma_rx->channel);
            if (total_index > uart->dma_rx->last_index)
            {
                recv_len = total_index - uart->dma_rx->last_index;
            }
            else
            {
                recv_len = total_index + (uart->serial.config.bufsz - uart->dma_rx->last_index);
            }
            uart->dma_rx->last_index = total_index;
        }

        rt_hw_interrupt_enable(level);

        if (recv_len)
        {
            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
        }
    }
}

void edma_tx_callback(LPUART_Type *base, lpuart_edma_handle_t *handle, status_t status, void *userData)
{
    struct imxrt_uart *uart = (struct imxrt_uart *)userData;
    RT_ASSERT(uart != RT_NULL);

    if (kStatus_LPUART_TxIdle == status)
    {
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_TX_DMADONE);
    }
}

static void imxrt_dma_rx_config(struct imxrt_uart *uart)
{
    RT_ASSERT(uart != RT_NULL);

    edma_transfer_config_t xferConfig;
    struct rt_serial_rx_fifo *rx_fifo;
    
    DMAMUX_SetSource(DMAMUX0, uart->dma_rx->channel, uart->dma_rx->request);
    DMAMUX_EnableChannel(DMAMUX0, uart->dma_rx->channel);
    EDMA_CreateHandle(&uart->dma_rx->edma, DMA0, uart->dma_rx->channel);
    EDMA_SetCallback(&uart->dma_rx->edma, edma_rx_callback, uart);

    rx_fifo = (struct rt_serial_rx_fifo *)uart->serial.serial_rx;

    EDMA_PrepareTransfer(&xferConfig,
                         (void *)LPUART_GetDataRegisterAddress(uart->uart_base),
                         sizeof(uint8_t),
                         rx_fifo->buffer,
                         sizeof(uint8_t),
                         sizeof(uint8_t),
                         uart->serial.config.bufsz,
                         kEDMA_PeripheralToMemory);

    EDMA_SubmitTransfer(&uart->dma_rx->edma, &xferConfig);
    EDMA_EnableChannelInterrupts(DMA0, uart->dma_rx->channel, kEDMA_MajorInterruptEnable | kEDMA_HalfInterruptEnable);
    EDMA_EnableAutoStopRequest(DMA0, uart->dma_rx->channel, false);
    /* complement to adjust final destination address */
    uart->dma_rx->edma.base->TCD[uart->dma_rx->channel].DLAST_SGA = -(uart->serial.config.bufsz);
    EDMA_StartTransfer(&uart->dma_rx->edma);
    LPUART_EnableRxDMA(uart->uart_base, true);

    LPUART_EnableInterrupts(uart->uart_base, kLPUART_IdleLineInterruptEnable);
    NVIC_SetPriority(uart->irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 4, 0));
    EnableIRQ(uart->irqn);

    LOG_D("%s dma rx config done\n", uart->name);
}

static void imxrt_dma_tx_config(struct imxrt_uart *uart)
{
    RT_ASSERT(uart != RT_NULL);
    
    DMAMUX_SetSource(DMAMUX0, uart->dma_tx->channel, uart->dma_tx->request);
    DMAMUX_EnableChannel(DMAMUX0, uart->dma_tx->channel);
    EDMA_CreateHandle(&uart->dma_tx->edma, DMA0, uart->dma_tx->channel);
    

    LPUART_TransferCreateHandleEDMA(uart->uart_base,
                                    &uart->dma_tx->uart_edma,
                                    edma_tx_callback,
                                    uart,
                                    &uart->dma_tx->edma,
                                    RT_NULL);

    LOG_D("%s dma tx config done\n", uart->name);
}

#endif

uint32_t GetUartSrcFreq(LPUART_Type *uart_base)
{
    uint32_t freq;
    uint32_t base = (uint32_t) uart_base;
#ifdef SOC_IMXRT1170_SERIES
    switch (base)
    {
    case LPUART1_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart1);
        break;
    case LPUART2_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart2);
        break;
    case LPUART3_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart3);
        break;
    case LPUART4_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart4);
        break;
    case LPUART5_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart5);
        break;
    case LPUART6_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart6);
        break;
    case LPUART7_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart7);
        break;
    case LPUART8_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart8);
        break;
    case LPUART9_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart9);
        break;
    case LPUART10_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart10);
        break;
    case LPUART11_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart11);
        break;
    case LPUART12_BASE:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart12);
        break;
    default:
        freq = CLOCK_GetRootClockFreq(kCLOCK_Root_Lpuart2);
        break;
    }
#else
    /* To make it simple, we assume default PLL and divider settings, and the only variable
       from application is use PLL3 source or OSC source */
    if (CLOCK_GetMux(kCLOCK_UartMux) == 0) /* PLL3 div6 80M */
    {
        freq = (CLOCK_GetPllFreq(kCLOCK_PllUsb1) / 6U) / (CLOCK_GetDiv(kCLOCK_UartDiv) + 1U);
    }
    else
    {
        freq = CLOCK_GetOscFreq() / (CLOCK_GetDiv(kCLOCK_UartDiv) + 1U);
    }
#endif
    return freq;

}

static rt_err_t imxrt_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct imxrt_uart *uart;
    lpuart_config_t config;
    gpio_pin_config_t gpio;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);

    uart = rt_container_of(serial, struct imxrt_uart, serial);

    LPUART_GetDefaultConfig(&config);
    config.baudRate_Bps = cfg->baud_rate;

    switch (cfg->data_bits)
    {
    case DATA_BITS_7:
        config.dataBitsCount = kLPUART_SevenDataBits;
        break;

    default:
        config.dataBitsCount = kLPUART_EightDataBits;
        break;
    }

    switch (cfg->stop_bits)
    {
    case STOP_BITS_2:
        config.stopBitCount = kLPUART_TwoStopBit;
        break;
    default:
        config.stopBitCount = kLPUART_OneStopBit;
        break;
    }

    switch (cfg->parity)
    {
    case PARITY_ODD:
        config.parityMode = kLPUART_ParityOdd;
        break;
    case PARITY_EVEN:
        config.parityMode = kLPUART_ParityEven;
        break;
    default:
        config.parityMode = kLPUART_ParityDisabled;
        break;
    }

    switch(cfg->flowcontrol)
    {
    case RT_SERIAL_FLOWCONTROL_CTSRTS:
        config.enableRxRTS = true;
        config.enableTxCTS = true;
        break;
    case RT_SERIAL_FLOWCONTROL_NONE:
    default:
        config.enableRxRTS = false;
        config.enableTxCTS = false;
        break;
    }

    config.enableTx = true;
    config.enableRx = true;

    LPUART_Init(uart->uart_base, &config, GetUartSrcFreq(uart->uart_base));

