RT-Thread/rt-thread/bsp/imxrt/libraries/drivers/drv_uart.c
     /* 初始化485引脚 */
    if(uart->uart_base == LPUART8)
    {
        gpio.direction      = kGPIO_DigitalOutput;  /* 输出模式 */
        gpio.outputLogic    = 0;                    /* 默认高电平 */
        gpio.interruptMode  = kGPIO_NoIntmode;      /* 不使用中断 */
        GPIO_PinInit(GET_485_RE_GPIO, GET_485_RE_GPIO_PIN, &gpio);    
    }

    return RT_EOK;
}

static rt_err_t imxrt_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    rt_ubase_t ctrl_arg = (rt_ubase_t)arg;
#endif

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        DisableIRQ(uart->irqn);
        break;

    case RT_DEVICE_CTRL_SET_INT:
        LPUART_EnableInterrupts(uart->uart_base, kLPUART_RxDataRegFullInterruptEnable);
        NVIC_SetPriority(uart->irqn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 4, 0));
        EnableIRQ(uart->irqn);
        break;

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    case RT_DEVICE_CTRL_CONFIG:

        if (RT_DEVICE_FLAG_DMA_RX == ctrl_arg)
        {
            imxrt_dma_rx_config(uart);
        }
        else if (RT_DEVICE_FLAG_DMA_TX == ctrl_arg)
        {
            imxrt_dma_tx_config(uart);
        }
        break;
#endif
    }

    return RT_EOK;
}

static int imxrt_putc(struct rt_serial_device *serial, char ch)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    
    if(LPUART8 == uart->uart_base)
    {
        SET_485_TO_SEND();
        LPUART_WriteByte(uart->uart_base, ch);
        while (!(LPUART_GetStatusFlags(uart->uart_base) & kLPUART_TransmissionCompleteFlag));
        SET_485_TO_RECIVE();
    }
    else
    {
        LPUART_WriteByte(uart->uart_base, ch);
        while (!(LPUART_GetStatusFlags(uart->uart_base) & kLPUART_TxDataRegEmptyFlag));
    }

    return 1;
}

static int imxrt_getc(struct rt_serial_device *serial)
{
    int ch;
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    ch = -1;
    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxDataRegFullFlag)
    {
        ch = LPUART_ReadByte(uart->uart_base);
    }

    return ch;
}

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
rt_size_t dma_tx_xfer(struct rt_serial_device *serial, rt_uint8_t *buf, rt_size_t size, int direction)
{
    struct imxrt_uart *uart;
    lpuart_transfer_t xfer;
    rt_size_t xfer_size = 0;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    if (0 != size)
    {
        if (RT_SERIAL_DMA_TX == direction)
        {
            xfer.data = buf;
            xfer.dataSize = size;
            if(LPUART8 == uart->uart_base) 
            {
                SET_485_TO_SEND();                
            }            
            if (LPUART_SendEDMA(uart->uart_base, &uart->dma_tx->uart_edma, &xfer) == kStatus_Success)
            {
                xfer_size = size;
            }
        }
    }

    return xfer_size;
}
#endif

static const struct rt_uart_ops imxrt_uart_ops =
{
    imxrt_configure,
    imxrt_control,
    imxrt_putc,
    imxrt_getc,
#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    dma_tx_xfer
#else
    RT_NULL
#endif
};

int rt_hw_uart_init(void)
{
    int i;
    rt_uint32_t flag;
    rt_err_t ret = RT_EOK;
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;

    flag = RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_INT_RX;

    uart_get_dma_config();

    for (i = 0; i < sizeof(uarts) / sizeof(uarts[0]); i++)
    {
        uarts[i].serial.ops    = &imxrt_uart_ops;
        uarts[i].serial.config = config;
        if (LPUART10 == uarts[i].uart_base) 
        {        
            uarts[i].serial.config.baud_rate = BAUD_RATE_4000000;
            uarts[i].serial.config.flowcontrol = RT_SERIAL_FLOWCONTROL_CTSRTS;
        }
        if (LPUART8 == uarts[i].uart_base) {
            uarts[i].serial.config.is_485 = RT_TRUE;
        } else {
            uarts[i].serial.config.is_485 = RT_FALSE;
        }

        ret = rt_hw_serial_register(&uarts[i].serial, uarts[i].name, flag | uarts[i].dma_flag, NULL);
    }

    return ret;
}
INIT_BOARD_EXPORT(rt_hw_uart_init);

#endif /* BSP_USING_LPUART */
